cypress/fixtures/INDUSTRY4.0/orderHistory/orderResponse.json

{
  "data": [
    {
      "id": 825,
      "attributes": {
        "order_id": "399",
        "bpp_id": "strapi-bpp-plugin",
        "bpp_uri": "https://strapi-bpp-network.becknprotocol.io",
        "currency": "INR",
        "delivery_status": "In Review",
        "descriptor": {
          "name": "MAX Fashion",
          "short_desc": "MAX fashion provider"
        },
        "price": 250,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "250",
            "currency": "INR"
          },
          "breakup": [
            {
              "item": {
                "id": "61"
              },
              "price": {
                "value": "200",
                "currency": "EUR"
              },
              "title": "Base Price"
            },
            {
              "item": {
                "id": "61"
              },
              "price": {
                "value": "50",
                "currency": "EUR"
              },
              "title": "Tax"
            }
          ]
        },
        "transaction_id": "9cf432f8-fe20-46d0-94f0-8904619c6745",
        "message_id": null,
        "payments": null,
        "items": {
          "id": "2",
          "code": "TSH",
          "name": "T Shirt",
          "tags": [
            {
              "list": [
                {
                  "value": "Fashion"
                }
              ],
              "display": true
            },
            {
              "list": [
                {
                  "value": "stretchable"
                }
              ],
              "display": true
            },
            {
              "list": [
                {
                  "value": "spandex"
                }
              ],
              "display": true
            }
          ],
          "price": {
            "value": "250",
            "currency": "INR"
          },
          "quantity": {
            "available": {
              "count": 460,
              "measure": {
                "unit": "kWh",
                "value": "460"
              }
            }
          },
          "long_desc": "Elevate your casual style with this vibrant blue polo t-shirt adorned with subtle stripes. Crafted from soft and breathable cotton fabric, it offers both comfort and a touch of sophistication. The classic collar and short sleeves ensure a timeless look, perfect for pairing with jeans or chinos for a relaxed yet refined ensemble.",
          "short_desc": "Elevate your casual style with this vibrant blue polo t-shirt adorned with subtle stripes."
        },
        "createdAt": "2024-04-03T10:41:54.758Z",
        "updatedAt": "2024-04-03T10:41:54.758Z",
        "publishedAt": "2024-04-03T10:41:54.751Z",
        "domain": null
      }
    },
    {
      "id": 826,
      "attributes": {
        "order_id": "400",
        "bpp_id": "strapi-bpp-plugin",
        "bpp_uri": "https://strapi-bpp-network.becknprotocol.io",
        "currency": "INR",
        "delivery_status": "In Review",
        "descriptor": {
          "name": "MAX Fashion",
          "short_desc": "MAX fashion provider"
        },
        "price": 250,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "250",
            "currency": "INR"
          },
          "breakup": [
            {
              "item": {
                "id": "61"
              },
              "price": {
                "value": "200",
                "currency": "EUR"
              },
              "title": "Base Price"
            },
            {
              "item": {
                "id": "61"
              },
              "price": {
                "value": "50",
                "currency": "EUR"
              },
              "title": "Tax"
            }
          ]
        },
        "transaction_id": "9cf432f8-fe20-46d0-94f0-8904619c6745",
        "message_id": null,
        "payments": null,
        "items": {
          "id": "2",
          "code": "TSH",
          "name": "T Shirt",
          "tags": [
            {
              "list": [
                {
                  "value": "Fashion"
                }
              ],
              "display": true
            },
            {
              "list": [
                {
                  "value": "stretchable"
                }
              ],
              "display": true
            },
            {
              "list": [
                {
                  "value": "spandex"
                }
              ],
              "display": true
            }
          ],
          "price": {
            "value": "250",
            "currency": "INR"
          },
          "quantity": {
            "available": {
              "count": 460,
              "measure": {
                "unit": "kWh",
                "value": "460"
              }
            }
          },
          "long_desc": "Elevate your casual style with this vibrant blue polo t-shirt adorned with subtle stripes. Crafted from soft and breathable cotton fabric, it offers both comfort and a touch of sophistication. The classic collar and short sleeves ensure a timeless look, perfect for pairing with jeans or chinos for a relaxed yet refined ensemble.",
          "short_desc": "Elevate your casual style with this vibrant blue polo t-shirt adorned with subtle stripes."
        },
        "createdAt": "2024-04-03T10:42:04.288Z",
        "updatedAt": "2024-04-03T10:42:04.288Z",
        "publishedAt": "2024-04-03T10:42:04.282Z",
        "domain": null
      }
    },
    {
      "id": 837,
      "attributes": {
        "order_id": "505b81d93907dd7f82c5ad60f47559ff2f6b1f70afebc63f7e48edb1e1d6ec73",
        "bpp_id": "vendure-dev-bpp.becknprotocol.io",
        "bpp_uri": "https://vendure-dev-bpp.becknprotocol.io",
        "currency": "INR",
        "delivery_status": "In Review",
        "descriptor": {
          "name": "Meru Coffee"
        },
        "price": 677.5,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "677.50",
            "currency": "INR"
          },
          "breakup": [
            {
              "price": {
                "value": "540.00",
                "currency": "INR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "25.00",
                "currency": "INR"
              },
              "title": "shipping"
            },
            {
              "price": {
                "value": "112.50",
                "currency": "INR"
              },
              "title": "taxes"
            }
          ]
        },
        "transaction_id": "47d0fc71-1451-490b-b1f0-495ac84054b0",
        "message_id": null,
        "payments": [
          {
            "id": "2",
            "name": "Default Payment",
            "time": {
              "label": "Transaction timestamp",
              "timestamp": "2024-04-04T10:22:28.811Z"
            },
            "type": "PRE-FULFILLMENT",
            "params": {
              "amount": "677.50",
              "currency": "INR",
              "transaction_id": ""
            },
            "status": "PAID"
          }
        ],
        "items": {
          "id": "2",
          "name": "Jayanthi Coffee",
          "price": {
            "value": "540.00",
            "currency": "INR",
            "listed_value": "540.00"
          },
          "quantity": {
            "selected": {
              "count": 1
            }
          },
          "long_desc": "<p><strong>85% Coffee And 15% Chicory&nbsp;</strong></p><ul><li><p>South indian coffee contains 85% pure coffee powder with fruity aroma and nutty flavour</p></li><li><p>Serve hot with frothy milk and sugar</p></li><li><p>Perfect for those who are habituated to drinking pure coffee but would like to try south indian filter coffee</p></li><li><p>Contains 15% premium ground chicory</p></li><li><p>Suitable for automatic coffee filter, epsresso machines</p></li></ul>"
        },
        "createdAt": "2024-04-04T10:22:34.882Z",
        "updatedAt": "2024-04-04T10:22:34.882Z",
        "publishedAt": "2024-04-04T10:22:34.876Z",
        "domain": null
      }
    },
    {
      "id": 840,
      "attributes": {
        "order_id": "e284cee6bc1c1f0f1225d8514c94e33d04b50c113b9ec72cf625f9f12f33d667",
        "bpp_id": "vendure-dev-bpp.becknprotocol.io",
        "bpp_uri": "https://vendure-dev-bpp.becknprotocol.io",
        "currency": "INR",
        "delivery_status": "In Review",
        "descriptor": {
          "name": "Meru Coffee"
        },
        "price": 1325.5,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "1325.50",
            "currency": "INR"
          },
          "breakup": [
            {
              "price": {
                "value": "1080.00",
                "currency": "INR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "25.00",
                "currency": "INR"
              },
              "title": "shipping"
            },
            {
              "price": {
                "value": "220.50",
                "currency": "INR"
              },
              "title": "taxes"
            }
          ]
        },
        "transaction_id": "f596b499-f2f4-4b8f-8e9e-290789068672",
        "message_id": null,
        "payments": [
          {
            "id": "2",
            "name": "Default Payment",
            "time": {
              "label": "Transaction timestamp",
              "timestamp": "2024-04-04T11:40:05.595Z"
            },
            "type": "PRE-FULFILLMENT",
            "params": {
              "amount": "1325.50",
              "currency": "INR",
              "transaction_id": ""
            },
            "status": "PAID"
          }
        ],
        "items": {
          "id": "2",
          "name": "Jayanthi Coffee",
          "price": {
            "value": "540.00",
            "currency": "INR",
            "listed_value": "540.00"
          },
          "quantity": {
            "selected": {
              "count": 2
            }
          },
          "long_desc": "<p><strong>85% Coffee And 15% Chicory&nbsp;</strong></p><ul><li><p>South indian coffee contains 85% pure coffee powder with fruity aroma and nutty flavour</p></li><li><p>Serve hot with frothy milk and sugar</p></li><li><p>Perfect for those who are habituated to drinking pure coffee but would like to try south indian filter coffee</p></li><li><p>Contains 15% premium ground chicory</p></li><li><p>Suitable for automatic coffee filter, epsresso machines</p></li></ul>"
        },
        "createdAt": "2024-04-04T11:40:11.053Z",
        "updatedAt": "2024-04-04T11:40:11.053Z",
        "publishedAt": "2024-04-04T11:40:11.045Z",
        "domain": null
      }
    }
  ],
  "meta": {
    "pagination": {
      "page": 1,
      "pageSize": 25,
      "pageCount": 1,
      "total": 12
    }
  }
}
